<template>
  <div>
    <v-card-title class="title">About</v-card-title>
    <Block
      v-for="i in contents"
      :key="i.title"
      :title="i.title"
      :content="i.content"
      id="block"
    />
  </div>
</template>
<script setup lang="ts">
import gsap from 'gsap'
if (process.client) {
  gsap.from('#block', { y: 100, opacity: 0, duration: 0.5 })
}
const contents = [
  {
    title: 'このサイトについて',
    content:
      'Nuxt.js ver3(public β)と Vuetify 3(public β)を使って Nuxt ３の勉強を兼ねて一晩で無理矢理作ったポートフォリオサイトです。2022/6のリリース後改修予定です。'
  },
  {
    title: '自己PR',
    content:
      'エンジニアとして働く中で一貫して目標としているのが「サービスを創れる人になること」です。プログラミングスキルに限った話ではありません。サービスを作るにあたって、プログラミングという手段を身に付けて初めてビジネスモデルやペルソナ・UXといったサービスデザインを現実的に検討できるようになると考えています。そのために全てにおいて貪欲に学習し、アウトプットを出し続けることができます。'
  },
  {
    title: '学生時代に力を入れたこと',
    content:
      '長期インターンで担当した歯科検索サイトの開発です。去年、ある企業に自社開発のサイトを作るフロントエンドエンジニアインターンとして採用頂きました。しかし、入社当時そのサイトはデザイン先行で見た目だけ実装され、DB設計はおろか要件定義すらなく、ビジネスサイドの要望のみが一人歩きしている状況でした。原因は、社長をはじめ直属の上司も非エンジニアであり適切な要件定義、タスク振り、費用感の説明ができる人がいない事でした。その状況下で、開発を適切に進めるために要求される技術（NuxtとAWS Amplify）について急ぎキャッチアップしつつ、すでにある程度言語化できている要求を元に、低コストかつ高速なAWSでのバックエンド構築、DB・API設計、歯科検索サイトと医院用サイトの実装の大半を一人で進めました。医院用サイトでは先入観とズレないインターフェースの実装を心掛けました。結果として上流から下流まで一貫した開発経験を積むことができました。'
  },
  {
    title: 'この先やっていきたいこと',
    content:
      '基本的にはエンジニアとしてサービスの開発です。しかし、その道程で日頃からフロントエンドをメインに情報や技術を積極的にキャッチアップし、本業に反映させていきます。サービスにおいて、フロントエンドはお客様と接点を持つ場所であり、UIやユーザーアクションの設計とバックエンドの実装都合を上手く吸収する場所であると考えています。現在、自分はLitやWebassemblyといった新しい技術を学習していますが、流行の変化の激しいフロントエンドで新しい有用な技術を採用することは一つの差別化、競争優位性になります。しかし、適切にサービスがデザインされていなければ、新技術と既存技術との間で不和を起こし、サービスとして成立させられません。そのため、自身の担当する範囲だけでなくサービス全体を視野に収めて設計やテストを不和が起きないようにしながらいち早く成果を社会に提供したいと考えています。'
  }
]
</script>
<style lang="scss" scoped>
.title {
  color: #444;
  font-size: 48px;
  font-weight: bold;
  margin: 20px auto;
  max-width: 800px;
}
</style>
